{
    "endReached":"You have reached the end of this section!",
    "continueToNext":"Continue to the next section:",
    "rememberToCheckPoints":"You can check your current points from the blue blob in the bottom-right corner of the page.",
    "footer-src":"Source code of the material",
    "footer-edit-page":"Edit page",
    "footer-report-issue":"Report issue",
    "makers":"This course is created by ",
    "rage":"of the University of Helsinki",
    "credits":"About the material and its creators",
    "twitter-aria":"Mooc.fi Twitter profile",
    "facebook-aria":"Mooc.fi Facebook profile",
    "yourube-aria":"Mooc.fi YouTube channel",
    "logout":"Log out",
    "newAccount":"Create a new account",
    "login":"Log in",
    "mailingListTitle":"Remind me when the course starts",
    "subscribe":"subscribe",
    "tableOfContents":"Table of contents",
    "sampleOutput":"Sample output",
    "sampleData":"Sample data",
    "loginToSeeExercise":"Log in to view the exercise",
    "loginToAttemptExercise":"Log in to complete the exercise.",
    "pleaseLogin":"You are not logged in. Some parts of the material are only for logged in users. You can log in here: ",
    "inThisSection":"In this part:" ,
    "programmingExercise":"Programming exercise:",
    "moodleExercise": "Moodle exercise:",
    "sqlTrainerExercise": "SQL trainer exercise:",
    "points":"Points",
    "submitNB":"NB: Some exercises have multiple parts, and you can receive points for the different parts separately. You can submit a partially completed exercise by choosing 'Submit Solution' from the menu next to the button for executing tests",
    "installationGuideLink":"",
    "submitHowTo":"",
    "loginForExercise":"Log in to view the exercise",
    "loginToSeeExercisePoints": "Log in to see exercise points.",
    "submitNetBeans":"Submit your solution to be checked on the server in the NetBeans programming environment: ",
    "seeSubmissions":"You can see your submissions in the Test My Code exercise submission environment.",
    "here":"here",
    "solutionHowTo":"How to view the solution",
    "coinSolutionHowTo":"How to view the solution before solving the exercise",
    "noCoin":"In this exercise you cannot use a coin to view the solution before submitting the exercise.",
    "noCoinsOnCourse": "You cannot view the solution before completing the exercise on this course.",
    "modelSolutionUnavailableBecauseEmailNotVerified": "Please verify your email address to enable solutions.",
    "whyCoin":"You can see the solution either before or after submitting the exercise. If you want to see the solution before submitting the exercise you have to use solution coins.",
    "coinCost": "A model solution costs the same amount of coins as the exercise is worth points.",
    "usesCoinMultiplePoints": "cost:",
    "usesCoinMultiplePoints2": "coins",
    "getNewCoin":"You will get a new solution coin when you have submitted",
    "getNewCoin2":"exercises. You can use coins to see exercise solutions and get yourself out of a pickle.",
    "oneCoin":"You have 1 coin",
    "howManyCoins":"You have <1>{{count}}</1> coins.",
    "nocoins":"You don't have any coins yet.",
    "howCoins":"You will only use a coin when you click the button which says 'Uses a coin' under this text. You can see the solution without using a coin in the Test My Code service either in Netbeans or on the TMC website after completing and submitting the relevant exercise.",
    "howSeeSolution":"You can see the solution in the Test My Code service either in TMCBeans or on the TMC website after completing the relevant exercise.",
    "seeSolution":"View solution",
    "usesCoin":"Uses a coin",
    "coinUsed":"You have already used a coin for this solution",
    "update":"Update",
    "solution":"Solution",
    "exerciseList":"List of exercises in this part",
    "unknownType":"Unknown exercise type",
    "quiz":"Quiz",
    "loading":"Loading a section of the course...",
    "loginToSee":"There is some content here which is available only to logged in users. Log in to see the content.",
    "errorInMaterial":"Cannot load this section of the material due to an error: ",
    "incorrectMaterial":"There is some incorrectly defined content here. Reason: no id.",
    "loggedInWith":"You are logged in as: ",
    "studentInfo":"Student information",
    "aboutYourself":"Tell us about yourself. This information helps us register course credits and organize the course. You can edit your information later in the course settings. After filling in your information, click 'Save' at the bottom of the page.",
    "firstName":"Given name",
    "lastName":"Family name",
    "sid":"University of Helsinki student number",
    "nosid":"Leave empty if you are not currently a student at the University of Helsinki.",
    "marketing":"You can send me information about new courses",
    "courseInfo": "Course information",
    "useCourseVariantLabel": "I am participating on some other course than a mooc.fi open course or a University of Helsinki course.",
    "courseVariant": "Course provider",
    "chooseCourse": "Choose course",
    "researchTitle":"Research themes on this course",
    "research1":"Data from this course is used to study learning. This research has multiple goals: ",
    "research2":"Create adaptable course materials, which take the differences between students into consideration, and when necessary provide more individualized learning materials.",
    "research3":"Increase our knowledge on learning in digital environments.",
    "research4":"Support other parties working with learning materials and learning research. This will naturally lead to better learning outcomes for students as well. ",
    "research5":"If you are interested in research on learning analytics, you can learn more from the article ",
    "research6":"The research data from this course is managed by Matti Luukkainen from the Agile Education Research group at the Department of Computer Science of the University of Helsinki. You can request the removal of any data collected about you at any time by sending an email to mooc@cs.helsinki.fi",
    "research7":"Data collected on this course is used in research. The collected data contains information about the use of the material, the process of completing exercises, and data collected from exams. If any research on the data is published, no individual student can be identified from the results. Refusing to take part in the research has no negative consequences for the course participant.",
    "researchAgree":"Participating in the research",
    "researchYes":"I will participate in the research. By selecting this option you will help current and future students.",
    "researchNo":"I will not participate in the research.",
    "save":"Save",
    "fillRequired":"Please fill in the required fields.",
    "reportIssueTitle":"How to report an issue in the material",
    "reportIssueButtonText":"Create new issue",
    "reportIssueSecondHeader":"How to compose the issue",
    "reportIssue1":"You can report a mistake you found on the issues tab of the course's Github project. Github is a service where projects, software and source code can be managed and shared to others.",
    "reportIssue2":"Reporting an issue requires a Github account. If you don't have an account yet, you can create it",
    "reportIssue3":"here",
    "reportIssue4":"Before you open a new issue, please check",
    "reportIssue5":"for an already opened issue regarding the mistake you found.",
    "reportIssue6":"We might ask some clarifying questions if we are unable to fix the issue without your help. Github should send an email notification regarding these questions to the email address linked to your Github account.",
    "reportIssue7":"Thank you for helping us improve our materials!",
    "reportIssueList1":"Press the button above.",
    "reportIssueList2":"Please include a short and informative title in your issue report, for example \"A typo in Part 1 in the description of exercise 30\".",
    "reportIssueList3":"Write a more detailed description of the issue in the comment section, for example \"In Part 1 exercise 30, the sample output contains a typo. The previous code includes a line System.out.println(\"Enter a number\");, but the sample output has the text \"Exit a number\"\".",
    "reportIssueList4":"Finally, press the green button \"Submit new issue\".",
    "editPageTitle":"How to propose an edit to the material",
    "editPageButtonText":"Edit the page ",
    "editPageSecondHeader":"How to send the edit proposal",
    "editPage1":"You can send an edit proposal to the course's Github project. Github is a service where projects, software and source code can be managed and shared to others.",
    "editPage2":"Sending an edit proposal requires a Github account. If you don't have an account yet, you can create it",
    "editPage3":"here",
    "editPage4":"Before sending your proposal, please check",
    "editPage5":"if someone has already proposed the same edit to the material.",
    "editPage6":"Thank you for helping us improve our materials!",
    "editPageList1":"Press the button above to edit the page where you just were.",
    "editPageList2":"Switch the wrapping style from \"No wrap\" --> \"Soft wrap\" in the top right corner of the editing window.",
    "editPageList3":"Find the section in the material you wish to edit. You can search for the correct section by pressing Ctrl+f and writing an appropriate search term.",
    "editPageList4":"Scroll to the bottom of the page and write a short and informative title in the field \"Propose file change\", for example \"Fixing a typo in Part 2\".",
    "editPageList5":"click the green button \"Propose file change\". This should redirect you to another page.",
    "editPageList6":"In the redirected page, click the button \"New Pull Request\".",
    "difficultyHeader": "Difficulty: -",
    "difficultyHeader1": "Difficulty: Easy",
    "difficultyHeader2": "Difficulty: Mediocre",
    "difficultyHeader3": "Difficulty: Hard"
}
