{
    "endReached":"",
    "continueToNext":"Seuraava osa:",
    "rememberToCheckPoints":"",
    "footer-src":"Materiaalin lähdekoodi",
    "footer-edit-page":"Muokkaa sivua",
    "footer-report-issue":"Ilmoita virhe",
    "makers":"Kurssin on tehnyt Helsingin yliopiston",
    "rage":"Agile Education Research -tutkimusryhmä",
    "credits":"Kiitokset ja materiaalista",
    "twitter-aria":"Mooc.fi:n Twitter -profiili",
    "facebook-aria":"Mooc.fi:n Facebook -profiili",
    "yourube-aria":"Mooc.fi:n YouTube -kanava",
    "logout":"Kirjaudu ulos",
    "newAccount":"Luo uusi tunnus",
    "login":"Kirjaudu sisään",
    "mailingListTitle":"Muistuta minua kun kurssi alkaa",
    "subscribe":"tilaa",
    "tableOfContents":"Sisällysluettelo",
    "sampleOutput":"Esimerkkitulostus",
    "sampleData":"Esimerkkidata",
    "loginToSeeExercise":"Kirjaudu sisään nähdäksesi tehtävän.",
    "loginToAttemptExercise":"Kirjaudu sisään tehdäksesi tehtävän.",
    "pleaseLogin":"Et ole kirjautunut sisään. Kaikki materiaalin osat eivät toimi ilman sisäänkirjautumista. Pääset kirjautumaan materiaaliin tästä:",
    "inThisSection":"Tässä osassa:" ,
    "programmingExercise":"Ohjelmointitehtävä:",
    "moodleExercise": "Moodle tehtävä:",
    "sqlTrainerExercise": "SQL trainer tehtävä:",
    "points":"Pisteitä",
    "submitNB":"Huom! Joissakin tehtävissä voit saada yksittäisen osan ratkaisusta osan tehtävän pisteistä lähettämällä ne palvelimelle valitsemalla 'Submit Solution' testien suorituspainikkeen oikealla puolella olevan painikkeen avaamasta valikosta",
    "installationGuideLink":"",
    "submitHowTo":"",
    "loginForExercise":"Kirjaudu sisään nähdäksesi tehtävänannon",
    "loginToSeeExercisePoints": "Kirjaudu sisään nähdäksesi tehtäväpisteet.",
    "submitNetBeans":"Palauta tehtävä palvelimelle tarkistettavaksi NetBeans ohjelmointiympäristössä:",
    "seeSubmissions":"Voit myöhemmin katsoa palautuksiasi Test My Code palautusympäristössä",
    "here":"täältä",
    "solutionHowTo":"Miten katsoa mallivastaus",
    "coinSolutionHowTo":"Miten katsoa mallivastaus ennen tehtävän ratkaisua",
    "noCoin":"Tässä tehtävässä ei voi käyttää kolikkoa mallivastauksen katsomiseen ennen tehtävän ratkaisua.",
    "noCoinsOnCourse": "Tällä kurssilla ei voi katsoa mallivastausta ennen tehtävän ratkaisemista.",
    "modelSolutionUnavailableBecauseEmailNotVerified": "Vahvista sähköpostiosoitteesi ennen kuin voit katsoa mallivastauksia.",
    "whyCoin":"Mallivastauksen voi katsoa joko ennen tehtävän ratkaisemista tai tehtävän ratkaisemisen jälkeen. Jos haluat katsoa vastauksen ennen ratkaisemista, joudut käyttämään mallivastauskolikoita.",
    "coinCost": "Yksi mallivastaus maksaa tehtävän pistemäärän verran kolikoita.",
    "usesCoinMultiplePoints": "maksaa",
    "usesCoinMultiplePoints2": "kolikkoa",
    "getNewCoin":"Saat aina uuden mallivastauskolikon, kun olet saanut",
    "getNewCoin2":"tehtävää tehtyä. Kolikoilla voi ostaa tehtävien vastauksia ja lunastaa itsesi mahdollisesta jumista.",
    "oneCoin":"Käytössäsi on tällä hetkellä 1 kolikko.",
    "howManyCoins":"Käytössäsi on tällä hetkellä <1>{{count}}</1> kolikkoa.",
    "nocoins":"Sinulla ei ole vielä yhtään kolikkoa.",
    "howCoins":"Kolikkoja kuluu vain silloin kun painat tämän tekstin alapuolella olevaa nappia, jossa lukee 'kuluttaa kolikon'. Pystyt katsomaan mallivastauksen ilman kolikkoja Test My Code -palvelusta joko Netbeanssin tai TMC:n nettisivun kautta sen jälkeen kun olet saanut tehtävän oikein.",
    "howSeeSolution":"Pystyt katsomaan mallivastauksen Test My Code -palvelusta joko TMCBeansin tai TMC:n nettisivun kautta sen jälkeen kun olet saanut tehtävän oikein.",
    "seeSolution":"Katso mallivastaus",
    "usesCoin":"Kuluttaa kolikon",
    "coinUsed":"olet käyttänyt jo kolikon tähän mallivastaukseen",
    "update":"Päivitä",
    "solution":"Mallivastaus",
    "exerciseList":"Lista osan tehtävistä",
    "unknownType":"Tuntematon tehtävätyyppi",
    "quiz":"Kysely",
    "loading":"Ladataan kurssisisällön osaa...",
    "loginToSee":"Tässä kohtaa materiaalia on sisältöä, joka näkyy vain sisäänkirjautuneille käyttäjille. Kirjaudu sisään nähdäksesi sen.",
    "errorInMaterial":"Kurssisisällön osaa ei pystytty lataamaan virheen takia:",
    "incorrectMaterial":"Tässä kohtaa on sisältöä, joka ei ole oikein määritelty. Syy: id puuttuu.",
    "loggedInWith":"Olet kirjautunut sisään tunnuksella: ",
    "studentInfo":"Opiskelijan tiedot",
    "aboutYourself":"Kerro itsestäsi. Nämä tiedot auttavat suoritusten merkitsemisessä ja kurssin järjestämisessä. Voit muokata tietoja myöhemmin kurssin asetuksista. Tietojen täyttämisen jälkeen paina 'Tallenna' sivun alareunasta.",
    "firstName":"Etunimi",
    "lastName":"Sukunimi",
    "sid":"Helsingin yliopiston opiskelijanumero",
    "nosid":"Jätä tyhjäksi, jos et ole tällä hetkellä Helsingin yliopiston opiskelija.",
    "courseInfo": "Kurssin tiedot",
    "useCourseVariantLabel": "Suoritan muuta kurssia kuin mooc.fi:n kaikille avointa verkkokurssia tai Helsingin yliopiston kurssia.",
    "courseVariant": "Kurssitoteutus",
    "chooseCourse": "Valitse kurssi",
    "marketing":"Minulle voi lähettää tietoa uusista kursseista",
    "researchTitle":"Kurssilla tehtävästä tutkimuksesta",
    "research1":" Kurssilla tehdään oppimiseen liittyvää tutkimusta. Tällä tutkimuksella on useampia tavoitteita:",
    "research2":"luoda oppimateriaali, joka ottaa yksilölliset erot huomioon ja reagoi tarvittaessa tarjoten kohdennetumpaa oppisisältöä",
    "research3":"kehittää digitaalisissa ympäristöissä tapahtuvaan oppimiseen liittyvää ymmärrystä ja tietoa, sekä",
    "research4":"tukea tutkimustiedon kautta muita oppimateriaalien kehittäjiä ja oppimisen tutkijoita. Tämä johtaa luonnollisesti myös parempaan oppimiskokemukseen opiskelijoille.",
    "research5":"Tällaisesta oppimisanalytiikaksi kutsutusta tutkimuksesta kiinnostuneiden kannattaa tutustua esimerkiksi artikkeliin ",
    "research6":"Tutkimuksesta vastaa Helsingin yliopiston tietojenkäsittelytieteen laitoksen Agile Education Research -ryhmän Matti Luukkainen. Voit myös pyytää milloin tahansa sinusta kerätyn datan poistamista lähettämällä sähköpostin osoitteeseen mooc@cs.helsinki.fi",
    "research7":"Työskentelystä kerättyä tietoa käytetään tutkimuksessa. Kerätty tieto sisältää tietoa oppimateriaalien käytöstä, kurssitehtävien tekemisestä sekä kokeissa pärjäämisestä. Tutkimustuloksista ei pystytä tunnistamaan yksittäisiä opiskelijoita. Jos et osallistu tutkimukseen, siitä ei tule minkäänlaisia seuraamuksia.",
    "researchAgree":"Tutkimukseen osallistuminen",
    "researchYes":"Osallistun oppimiseen liittyvään tutkimukseen. Valitsemalla tämän autat sekä nykyisiä että tulevia opiskelijoita.",
    "researchNo":"En osallistu oppimiseen liittyvään tutkimukseen.",
    "save":"Tallenna",
    "fillRequired":"Täytä vaaditut kentät.",
    "reportIssueTitle":"Näin ilmoitat virheen materiaalissa",
    "reportIssueButtonText":"Luo uusi virheilmoitus",
    "reportIssueSecondHeader":"Luo virheilmoitus näin",
    "reportIssue1":"Voit ilmoittaa huomaamasi virheen kurssin Github-projekin virheilmoitustaululle. Github on yleinen palvelu, jossa voi hallinnoida ja jakaa muille projekteja, ohjelmistoja ja lähdekoodia.",
    "reportIssue2":"Virheiden ilmoittaminen vaatii käyttäjätunnukset Githubiin. Jos sinulla ei ole vielä Github-tunnusta, voit luoda sen",
    "reportIssue3":"täältä",
    "reportIssue4":"Ennen kuin avaat uuden virheilmoituksen löytämästäsi virheestä, katsothan",
    "reportIssue5":"ettei siitä ole jo avointa ilmoitusta.",
    "reportIssue6":"Saatamme kysyä ilmoituksestasi tarkentavia kysymyksiä, jos emme osaa korjata ongelmaa ilman apuasi. Näistä kysymyksistä pitäisi tulla sähköposti-ilmoitus siihen osoitteeseen, jonka liitit Github-tunnukseesi.",
    "reportIssue7":"Kiitos kun autat meitä parantamaan materiaaleja!",
    "reportIssueList1":"Paina yllä olevaa nappia.",
    "reportIssueList2":"Laita ilmoituksen otsikoksi lyhyt ja ytimekäs kuvaus ongelmasta, esimerkiksi \"Osan 1 tehtävässä 30 kirjoitusvirhe\".",
    "reportIssueList3":"Kirjoita kommenttiosioon tarkempi kuvaus ongelmasta, esimerkiksi \"Osan 1 tehtävän 30 esimerkkitulosteessa on kirjoitusvirhe. Esimerkkitulosteen ylläoleva koodi sisältää rivin System.out.println(\"Syötä liukuluku\");, mutta esimerkkitulosteessa lukee \"Juota liukuluku\"\".",
    "reportIssueList4":"Paina lopuksi vihreää nappia \"Submit new issue\".",
    "editPageTitle":"Näin lähetät muutosehdotuksen materiaaliin",
    "editPageButtonText":"Muokkaa sivua ",
    "editPageSecondHeader":"Lähetä muutosehdotus näin",
    "editPage1":"Voit lähettää muutosehdotuksen kurssin Github-projekiin. Github on yleinen palvelu, jossa voi hallinnoida ja jakaa muille projekteja, ohjelmistoja ja lähdekoodia.",
    "editPage2":"Muutosehdotusten lähettäminen vaatii käyttäjätunnukset Githubiin. Jos sinulla ei ole vielä Github-tunnusta, voit luoda sen",
    "editPage3":"täältä",
    "editPage4":"Ennen kuin lähetät muutosehdotuksesi, katsothan",
    "editPage5":"ettei joku muu ole jo lähettänyt samaa muutosehdotusta.",
    "editPage6":"Kiitos kun autat meitä parantamaan materiaaleja!",
    "editPageList1":"Paina yllä olevaa nappia muokataksesi sivua, jolla olit äsken.",
    "editPageList2":"Vaihda muokkausikkunan oikeasta yläkulmasta \"No wrap\" --> \"Soft wrap\".",
    "editPageList3":"Etsi materiaalin kohta, johon haluat tehdä muutoksen. Voit hakea sopivaa kohtaa painamalla näppäinyhdistelmää Ctrl+f ja kirjoittamalla hakukenttään sopivan hakutermin.",
    "editPageList4":"Selaa sivun alareunaan, ja kirjoita osioon \"Propose file change\" lyhyt ja ytimekäs otsikko, esimerkiksi \"Kappaleen 2 kirjoitusvirheen korjaus\".",
    "editPageList5":"Paina vihreää nappia \"Propose file change\".",
    "editPageList6":"Paina avautuvalta sivulta nappia \"New Pull Request\".",
    "difficultyHeader": "Vaikeustaso: -",
    "difficultyHeader1": "Vaikeustaso: Helppo",
    "difficultyHeader2": "Vaikeustaso: Kohtalainen",
    "difficultyHeader3": "Vaikeustaso: Vaikea"
}
